HiveCHT/Fluid/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                  |
|   \\  /    A nd           | Web:      www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alphat;
    location    "0";
    
}
dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type        compressible::alphatWallFunction;
        value       uniform 0;
    }
    outlet
    {
        type        compressible::alphatWallFunction;
        value       uniform 0;
    }

    bottom
    {
        type        compressible::alphatWallFunction;
        value       uniform 0;
    }
    top
    {
        type        compressible::alphatWallFunction;
        value       uniform 0;
    }
    BroodHole
    {
        type        compressible::alphatWallFunction;
        value       uniform 0;
    }
    SolidHole
    {
        type        compressible::alphatWallFunction;
        value       uniform 0;
    }

    frontAndBack
    {
        type        empty;
    }
}

