HiveCHT/Fluid/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                  |
|   \\  /    A nd           | Web:      www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
    location    "0";
    
}
dimensions      [0 2 -1 0 0 0 0];
internalField   uniform 1e-6; 
boundaryField
{
    inlet       
    { 
    type calculated; 
    value uniform 1e-6; 
    }
    outlet      
    { 
    type calculated; 
    value uniform 1e-6;
    }
    top         
    { 
    type calculated; 
    value uniform 1e-6; 
    }
    bottom      
    { 
    type calculated; 
    value uniform 1e-6; 
    }
    BroodHole   
    { 
    type nutkWallFunction; 
    value uniform 0; 
    }
    SolidHole   
    { 
    type nutkWallFunction; 
    value uniform 0; 
    }
}

