HiveCHT/Fluid/constant/thermophysicalProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;      
    thermo          hConst;
    equationOfState perfectGas;
    specie          specie;
    energy          sensibleEnthalpy;
}
mixture
{
    specie
    {
        molWeight   28.96;
    }
    thermodynamics
    {
        Cp          1006.0;     
        Hf          0;
    }
    transport
    {
        mu          1.76e-5;    
        Pr          0.72;      
    }
}
