HiveCHT/Fluid/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
convertToMeters 0.001;

vertices
(
    // Riga inferiore del dominio (Y = 0 mm)
    (0 0 0)       // 0
    (822 0 0)     // 1
    (842 0 0)     // 2
    (893 0 0)     // 3
    (1107 0 0)    // 4
    (1158 0 0)    // 5
    (1178 0 0)    // 6
    (2000 0 0)    // 7

    // Riga a Y = 392.5 mm
    (0 392.5 0)   // 8
    (822 392.5 0) // 9
    (842 392.5 0) // 10
    (893 392.5 0) // 11
    (1107 392.5 0)// 12
    (1158 392.5 0)// 13
    (1178 392.5 0)// 14
    (2000 392.5 0)// 15
    
    // Riga a Y = 487.5 mm 
    (0 487.5 0)   // 16
    (822 487.5 0) // 17
    (842 487.5 0) // 18
    (893 487.5 0) // 19
    (1107 487.5 0)// 20
    (1158 487.5 0)// 21
    (1178 487.5 0)// 22
    (2000 487.5 0)// 23

    // Riga a Y = 587.5 mm (top rettangolo piccolo)
    (0 587.5 0)   // 24
    (822 587.5 0) // 25
    (842 587.5 0) // 26
    (893 587.5 0) // 27
    (1107 587.5 0)// 28
    (1158 587.5 0)// 29
    (1178 587.5 0)// 30
    (2000 587.5 0)// 31

    // Riga a Y = 607.5 mm (barra orizzontale superiore C)
    (0 607.5 0)   // 32
    (822 607.5 0) // 33
    (842 607.5 0) // 34
    (893 607.5 0) // 35
    (1107 607.5 0)// 36
    (1158 607.5 0)// 37
    (1178 607.5 0)// 38
    (2000 607.5 0)// 39

    // Riga superiore del dominio (Y = 1000 mm)
    (0 1000 0)    // 40
    (822 1000 0)  // 41
    (842 1000 0)  // 42
    (893 1000 0)  // 43
    (1107 1000 0) // 44
    (1158 1000 0) // 45
    (1178 1000 0) // 46
    (2000 1000 0) // 47

    // --- Copia con Z = 1 mm ---
    (0 0 1)       // 48
    (822 0 1)     // 49
    (842 0 1)     // 50
    (893 0 1)     // 51
    (1107 0 1)    // 52
    (1158 0 1)    // 53
    (1178 0 1)    // 54
    (2000 0 1)    // 55

    (0 392.5 1)   // 56
    (822 392.5 1) // 57
    (842 392.5 1) // 58
    (893 392.5 1) // 59
    (1107 392.5 1)// 60
    (1158 392.5 1)// 61
    (1178 392.5 1)// 62
    (2000 392.5 1)// 63

    (0 487.5 1)   // 64
    (822 487.5 1) // 65
    (842 487.5 1) // 66
    (893 487.5 1) // 67
    (1107 487.5 1)// 68
    (1158 487.5 1)// 69
    (1178 487.5 1)// 70
    (2000 487.5 1)// 71

    (0 587.5 1)   // 72
    (822 587.5 1) // 73
    (842 587.5 1) // 74
    (893 587.5 1) // 75
    (1107 587.5 1)// 76
    (1158 587.5 1)// 77
    (1178 587.5 1)// 78
    (2000 587.5 1)// 79

    (0 607.5 1)   // 80
    (822 607.5 1) // 81
    (842 607.5 1) // 82
    (893 607.5 1) // 83
    (1107 607.5 1)// 84
    (1158 607.5 1)// 85
    (1178 607.5 1)// 86
    (2000 607.5 1)// 87

    (0 1000 1)    // 88
    (822 1000 1)  // 89
    (842 1000 1)  // 90
    (893 1000 1)  // 91
    (1107 1000 1) // 92
    (1158 1000 1) // 93
    (1178 1000 1) // 94
    (2000 1000 1) // 95
       
    // Riga a Y = 485.5 mm
    (0 465.5 0)   // 96
    (822 465.5 0) // 97
    (842 465.5 0) // 98
    (893 465.5 0) // 99
    (1107 465.5 0)// 100
    (1158 465.5 0)// 101
    (1178 465.5 0)// 102
    (2000 465.5 0)// 103
        
    // Riga a Y = 485.5 mm Z=1
    (0 465.5 1)   // 104
    (822 465.5 1) // 105
    (842 465.5 1) // 106
    (893 465.5 1) // 107
    (1107 465.5 1)// 108
    (1158 465.5 1)// 109
    (1178 465.5 1)// 110
    (2000 465.5 1)// 111
    
    // Riga a Y = 585.5 mm
    (0 565.5 0)   // 112
    (822 565.5 0) // 113
    (842 565.5 0) // 114
    (893 565.5 0) // 115
    (1107 565.5 0)// 116
    (1158 565.5 0)// 117
    (1178 565.5 0)// 118
    (2000 565.5 0)// 119
    
    // Riga a Y = 585.5 mm Z=1
    (0 565.5 1)   // 120
    (822 565.5 1) // 121
    (842 565.5 1) // 122
    (893 565.5 1) // 123
    (1107 565.5 1)// 124
    (1158 565.5 1)// 125
    (1178 565.5 1)// 126
    (2000 565.5 1)// 127
);

blocks
(
    // Riga inferiore fino a y=392.5
    hex (0 1 9 8 48 49 57 56) (103 49 1) simpleGrading (1 1 1)
    hex (1 2 10 9 49 50 58 57) (10 49 1)  simpleGrading (1 1 1)
    hex (2 3 11 10 50 51 59 58) (13 49 1)  simpleGrading (1 1 1)
    hex (3 4 12 11 51 52 60 59) (54 49 1)  simpleGrading (1 1 1)
    hex (4 5 13 12 52 53 61 60) (13 49 1)  simpleGrading (1 1 1)
    hex (5 6 14 13 53 54 62 61) (10 49 1)  simpleGrading (1 1 1)
    hex (6 7 15 14 54 55 63 62) (103 49 1) simpleGrading (1 1 1)

    // Fascia 392.5 → 465.5
    hex (8 9 97 96 56 57 105 104)     (103 19 1) simpleGrading (1 1 1)
    hex (10 11 99 98 58 59 107 106)   (13 19 1)  simpleGrading (1 1 1)
    hex (11 12 100 99 59 60 108 107)  (54 19 1)  simpleGrading (1 1 1)
    hex (12 13 101 100 60 61 109 108) (13 19 1)  simpleGrading (1 1 1)
    hex (14 15 103 102 62 63 111 110) (103 19 1) simpleGrading (1 1 1)

    // Fascia 465.5 → 565.5
    hex (96 97 113 112 104 105 121 120)   (103 25 1) simpleGrading (1 1 1)
    hex (98 99 115 114 106 107 123 122)   (13 25 1)  simpleGrading (1 1 1)
    hex (100 101 117 116 108 109 125 124) (13 25 1)  simpleGrading (1 1 1)
    hex (102 103 119 118 110 111 127 126) (103 25 1) simpleGrading (1 1 1)

    // Fascia 565.5 → 587.5
    hex (112 113 25 24 120 121 73 72) (103 6 1)  simpleGrading (1 1 1)
    hex (114 115 27 26 122 123 75 74) (13 11 1)  simpleGrading (1 1 1)
    hex (115 116 28 27 123 124 76 75) (54 11 1)  simpleGrading (1 1 1)
    hex (116 117 29 28 124 125 77 76) (13 11 1)  simpleGrading (1 1 1)
    hex (118 119 31 30 126 127 79 78) (103 6 1)  simpleGrading (1 1 1)

    // Barra orizzontale C (587.5 → 607.5) 
    hex (24 25 33 32 72 73 81 80) (103 5 1) simpleGrading (1 1 1)
    hex (30 31 39 38 78 79 87 86) (103 5 1) simpleGrading (1 1 1)

    // Riga superiore fino a y=1000 
    hex (32 33 41 40 80 81 89 88) (103 98 1) simpleGrading (1 1 1)
    hex (33 34 42 41 81 82 90 89) (10 98 1)  simpleGrading (1 1 1)
    hex (34 35 43 42 82 83 91 90) (26 98 1)  simpleGrading (1 1 1)
    hex (35 36 44 43 83 84 92 91) (54 98 1)  simpleGrading (1 1 1)
    hex (36 37 45 44 84 85 93 92) (26 98 1)  simpleGrading (1 1 1)
    hex (37 38 46 45 85 86 94 93) (10 98 1)  simpleGrading (1 1 1)
    hex (38 39 47 46 86 87 95 94) (103 98 1) simpleGrading (1 1 1)
);




edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 8 56 48)
            (8 96 104 56)
            (96 112 120 104)
            (112 24 72 120)
            (24 32 80 72)
            (32 40 88 80)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (7 15 63 55)         
            (15 103 111 63)       
            (103 119 127 111)     
            (119 31 79 127)      
            (31 39 87 79)         
            (39 47 95 87)        
        );
    }

    bottom
    {
        type wall;
        faces
        (
            (0 1 49 48)
            (1 2 50 49)
            (2 3 51 50)
            (3 4 52 51)   
            (4 5 53 52)
            (5 6 54 53)
            (6 7 55 54)
        );
    }

    top
    {
        type wall;
        faces
        (
            (40 41 89 88)
            (41 42 90 89)
            (42 43 91 90)
            (43 44 92 91)
            (44 45 93 92)
            (45 46 94 93)
            (46 47 95 94)
        );
    }

    // Foro rettangolare piccolo
    BroodHole
    {
        type wall;
        faces
        (
            (99 100 108 107)   // base y=485.5
            (100 116 124 108)  // lato destro x=1107
            (115 116 124 123)  // top  y=585.5
            (99 115 123 107)   // lato sinistro x=893
        );
    }


    SolidHole
{
    type wall;
    faces
    (
        // ===== Gamba sinistra (x = 822 e x = 842) 
        (9 10 58 57)        // x=822→842
        (13 14 62 61)       // x=1158→1178
        // Lato x = 822 
        (9 97 105 57)        // 392.5 → 485.5
        (97 113 121 105)     // 485.5 → 585.5
        (113 25 73 121)      // 585.5 → 587.5
        (25 33 81 73)        // 587.5 → 607.5

        // Lato x = 842
        (10 98 106 58)       // 392.5 → 485.5
        (98 114 122 106)     // 485.5 → 585.5
        (114 26 74 122)      // 585.5 → 587.5


        // ===== Gamba destra (x = 1158 e x = 1178)
        // Lato x = 1158
        (13 101 109 61)      // 392.5 → 485.5
        (101 117 125 109)    // 485.5 → 585.5
        (117 29 77 125)      // 585.5 → 587.5


        // Lato x = 1178 (sempre a contatto col fluido)
        (14 102 110 62)      // 392.5 → 485.5
        (102 118 126 110)    // 485.5 → 585.5
        (118 30 78 126)      // 585.5 → 587.5
        (30 38 86 78)        // 587.5 → 607.5

        // ===== Barra orizzontale della C (attaccata alle gambe) =====
        // bordo inferiore (y = 587.5) a contatto col fluido 
        (26 27 75 74)        // 842 → 893
        (27 28 76 75)        // 893 → 1107
        (28 29 77 76)        // 1107 → 1158

        // bordo superiore (y = 607.5) a contatto col fluido sopra
        (34 35 83 82)        // 842 → 893
        (35 36 84 83)        // 893 → 1107
        (36 37 85 84)        // 1107 → 1158

        // “cappelli” superiori delle gambe (y=607.5), entrambi a contatto col fluido
        (33 34 82 81)        // top gamba sinistra
        (37 38 86 85)        // top gamba destra
    );
}

    frontAndBack
    {
        type empty;
        faces
        (
            // ---------- Z = 0 ----------
            (0 1 9 8)
            (1 2 10 9)
            (2 3 11 10)
            (3 4 12 11)
            (4 5 13 12)
            (5 6 14 13)
            (6 7 15 14)

            // 392.5 → 485.5 
            (8 9 97 96)
            (10 11 99 98)
            (11 12 100 99)
            (12 13 101 100)
            (14 15 103 102)

            // 485.5 → 585.5 
            (96 97 113 112)
            (98 99 115 114)
            (100 101 117 116)
            (102 103 119 118)

            // 585.5 → 607.5
            (112 113 25 24)
            (114 115 27 26)
            (115 116 28 27)  
            (116 117 29 28)
            (118 119 31 30)

            // 607.5 → top barra C
            (24 25 33 32)
            (30 31 39 38)

            // 607.5 → 1000
            (32 33 41 40)
            (33 34 42 41)
            (34 35 43 42)
            (35 36 44 43)
            (36 37 45 44)
            (37 38 46 45)
            (38 39 47 46)

            // ---------- Z = 1 ----------
            (48 49 57 56)
            (49 50 58 57)
            (50 51 59 58)
            (51 52 60 59)
            (52 53 61 60)
            (53 54 62 61)
            (54 55 63 62)

            // 392.5 → 485.5 
            (56 57 105 104)
            (58 59 107 106)
            (59 60 108 107)
            (60 61 109 108)
            (62 63 111 110)

            // 485.5 → 585.5 
            (104 105 121 120)
            (106 107 123 122)
            (108 109 125 124)
            (110 111 127 126)

            // 585.5 → 607.5
            (120 121 73 72)
            (122 123 75 74)
            (123 124 76 75)  
            (124 125 77 76)
            (126 127 79 78)

            // 607.5 → top barra C
            (72 73 81 80)
            (78 79 87 86)

            // 607.5 → 1000
            (80 81 89 88)
            (81 82 90 89)
            (82 83 91 90)
            (83 84 92 91)
            (84 85 93 92)
            (85 86 94 93)
            (86 87 95 94)
        );
    }
);

mergePatchPairs();

