HiveCHT/Fluid/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     buoyantPimpleFoam;
startFrom       startTime;
startTime       0;

stopAt          endTime;
endTime         21600;

deltaT          0.1;      
adjustTimeStep  no;
maxCo           5.0;          

writeControl    runTime;
writeInterval   5.0;

purgeWrite      0;
writeFormat     ascii;
writePrecision  8;
writeCompression off;

timeFormat      general;
timePrecision   6;

functions
{
    preCICE_Adapter
    {
        type    preciceAdapterFunctionObject;
        libs   ("libpreciceAdapterFunctionObject.so");
    }


    wallHeatFlux
    {
        type            wallHeatFlux;
        libs            ("libfieldFunctionObjects.so");

        // quando calcolarlo/scriverlo
        executeControl  outputTime;
        writeControl    none;         
        writeFields     false;         

 
        regionType      patch;
        patches         (BroodHole SolidHole);
    }

    // Integrale su BroodHole
    qIn_BroodHole
    {
        type            surfaceFieldValue;
        libs            ("libfieldFunctionObjects.so");

        writeControl    outputTime;
        writeToFile     true;         
        log             true;
        writeFields     false;

        regionType      patch;
        name            BroodHole;

        operation       areaIntegrate;
        fields          (wallHeatFlux);   
    }

    // Integrale su SolidHole
    qIn_SolidHole
    {
        type            surfaceFieldValue;
        libs            ("libfieldFunctionObjects.so");

        writeControl    outputTime;
        writeToFile     true;
        log             true;
        writeFields     false;

        regionType      patch;
        name            SolidHole;

        operation       areaIntegrate;
        fields          (wallHeatFlux);   
    }
}






