HiveCHT/Fluid/system/fvSchemes
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}

ddtSchemes
{
    default         backward;
}

gradSchemes
{
    default        cellLimited Gauss linear 1;
}

divSchemes
{
    default         none;
    div(phi,h)    Gauss upwind;
    div(phi,U)    Gauss  upwind;
    div(phiv,p)     Gauss linear;
    div(phi,e)      Gauss upwind;
    div(phi,k)      Gauss upwind;
    div(phi,omega) Gauss upwind;
    div(phi,epsilon) Gauss upwind;
    div(phi,R)      Gauss upwind;
    div(phi,K)      Gauss linear;
    div(phi,Ekp)    Gauss linear;
    div(R)          Gauss linear;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
    div(phi,nuTilda) Gauss upwind;  
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}
wallDist
{
    method meshWave;
}

