HiveCHT/Fluid/system/preciceDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      preciceDict;
}

preciceConfig "../precice-config.xml";
participant Fluid;
modules (CHT);

interfaces
{
    SolidHole
    {
        mesh    Fluid-Mesh;
        patches (BroodHole SolidHole);

        readData
        (
            Heat-Flux
        );

        writeData
        (
            Temperature
        );
    };
}

